<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1,8" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0,Func/StatefulPartitionedCall/input/_0:0,StatefulPartitionedCall/first_keras/transpose,StatefulPartitionedCall/first_keras/transpose:0,input_1,input_1:0">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="unknown_6" type="Const" version="opset1">
			<data element_type="f32" shape="16, 4, 146" offset="0" size="37376" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_8,Func/StatefulPartitionedCall/input/_8:0,StatefulPartitionedCall/first_keras/MatMul_2/ReadVariableOp,StatefulPartitionedCall/first_keras/MatMul_2/ReadVariableOp:0,unknown_6,unknown_6:0">
					<dim>16</dim>
					<dim>4</dim>
					<dim>146</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="unknown_3" type="Const" version="opset1">
			<data element_type="f32" shape="16, 146, 145" offset="37376" size="1354880" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_5,Func/StatefulPartitionedCall/input/_5:0,StatefulPartitionedCall/first_keras/MatMul_1/ReadVariableOp,StatefulPartitionedCall/first_keras/MatMul_1/ReadVariableOp:0,unknown_3,unknown_3:0">
					<dim>16</dim>
					<dim>146</dim>
					<dim>145</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="unknown" type="Const" version="opset1">
			<data element_type="f32" shape="2320, 8" offset="1392256" size="74240" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_1,Func/StatefulPartitionedCall/input/_1:0,StatefulPartitionedCall/first_keras/MatMul/ReadVariableOp,StatefulPartitionedCall/first_keras/MatMul/ReadVariableOp:0,unknown,unknown:0">
					<dim>2320</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/first_keras/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>2320</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/MatMul,StatefulPartitionedCall/first_keras/MatMul:0">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="unknown_0" type="Const" version="opset1">
			<data element_type="f32" shape="2320, 1" offset="1466496" size="9280" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_2,Func/StatefulPartitionedCall/input/_2:0,StatefulPartitionedCall/first_keras/Equal/ReadVariableOp,StatefulPartitionedCall/first_keras/Equal/ReadVariableOp:0,StatefulPartitionedCall/first_keras/Less/ReadVariableOp,StatefulPartitionedCall/first_keras/Less/ReadVariableOp:0,unknown_0,unknown_0:0">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/first_keras/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Less,StatefulPartitionedCall/first_keras/Less:0">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/first_keras/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast,StatefulPartitionedCall/first_keras/Cast:0">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/first_keras/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal,StatefulPartitionedCall/first_keras/Equal:0">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/first_keras/Cast_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_1,StatefulPartitionedCall/first_keras/Cast_1:0">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/first_keras/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Add,StatefulPartitionedCall/first_keras/Add:0">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Concat_325" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="1475776" size="12" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape/shape,StatefulPartitionedCall/first_keras/Reshape/shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/first_keras/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>2320</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape,StatefulPartitionedCall/first_keras/Reshape:0">
					<dim>16</dim>
					<dim>145</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/first_keras/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>146</dim>
					<dim>145</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>145</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/MatMul_1,StatefulPartitionedCall/first_keras/MatMul_1:0">
					<dim>16</dim>
					<dim>146</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Concat_346" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="1475788" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_1/shape,StatefulPartitionedCall/first_keras/Reshape_1/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/first_keras/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>146</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_1,StatefulPartitionedCall/first_keras/Reshape_1:0">
					<dim>2336</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="unknown_5" type="Const" version="opset1">
			<data element_type="f32" shape="2336, 1" offset="1475796" size="9344" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_7,Func/StatefulPartitionedCall/input/_7:0,StatefulPartitionedCall/first_keras/Equal_1/ReadVariableOp,StatefulPartitionedCall/first_keras/Equal_1/ReadVariableOp:0,unknown_5,unknown_5:0">
					<dim>2336</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/first_keras/Equal_1" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2336</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2336</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal_1,StatefulPartitionedCall/first_keras/Equal_1:0">
					<dim>2336</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/first_keras/Cast_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>2336</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_2,StatefulPartitionedCall/first_keras/Cast_2:0">
					<dim>2336</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Concat_373" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="1485140" size="12" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_2/shape,StatefulPartitionedCall/first_keras/Reshape_2/shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/first_keras/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>2336</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_2,StatefulPartitionedCall/first_keras/Reshape_2:0">
					<dim>16</dim>
					<dim>146</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/first_keras/MatMul_2" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>146</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>146</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/MatMul_2,StatefulPartitionedCall/first_keras/MatMul_2:0">
					<dim>16</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Concat_398" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="1485152" size="12" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_3/shape,StatefulPartitionedCall/first_keras/Reshape_3/shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/first_keras/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_3,StatefulPartitionedCall/first_keras/Reshape_3:0">
					<dim>16</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/first_keras/Sum/reduction_indices" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="1485164" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Sum/reduction_indices,StatefulPartitionedCall/first_keras/Sum/reduction_indices:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/first_keras/Sum" type="ReduceSum" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Sum,StatefulPartitionedCall/first_keras/Sum:0">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_413" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="1485168" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Transpose_414" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/StatefulPartitionedCall/output/_10,Func/StatefulPartitionedCall/output/_10:0,Identity,Identity:0,StatefulPartitionedCall/Identity,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/first_keras/transpose_1,StatefulPartitionedCall/first_keras/transpose_1:0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Identity" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="1" from-port="0" to-layer="21" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="13" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="4" from-port="2" to-layer="8" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="5" from-port="0" to-layer="8" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="10" to-port="0" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="13" to-port="1" />
		<edge from-layer="13" from-port="2" to-layer="15" to-port="0" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="1" />
		<edge from-layer="15" from-port="2" to-layer="17" to-port="0" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="20" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="20" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="27" to-port="0" />
		<edge from-layer="26" from-port="0" to-layer="27" to-port="1" />
		<edge from-layer="27" from-port="2" to-layer="28" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<Runtime_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<conversion_parameters>
			<framework value="tf" />
			<input_shape value="[1,8]" />
			<model_name value="GEMM_scaling_trees_16" />
			<output_dir value="DIR" />
			<saved_model_dir value="DIR" />
			<use_new_frontend value="True" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
