<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1,8" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0,Func/StatefulPartitionedCall/input/_0:0,input_1,input_1:0">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="unknown_3" type="Const" version="opset1">
			<data element_type="f32" shape="512, 4" offset="0" size="8192" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_5,Func/StatefulPartitionedCall/input/_5:0,unknown_3,unknown_3:0">
					<dim>512</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_2421" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8192" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_2420" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8192" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_2419" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8192" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="unknown" type="Const" version="opset1">
			<data element_type="i64" shape="32" offset="8200" size="256" />
			<output>
				<port id="0" precision="I64" names="Func/StatefulPartitionedCall/input/_1,Func/StatefulPartitionedCall/input/_1:0,StatefulPartitionedCall/first_keras/GatherV2/ReadVariableOp,StatefulPartitionedCall/first_keras/GatherV2/ReadVariableOp:0,unknown,unknown:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/first_keras/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="8456" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2/axis,StatefulPartitionedCall/first_keras/GatherV2/axis:0" />
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/first_keras/GatherV2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2,StatefulPartitionedCall/first_keras/GatherV2:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_2416" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32" offset="8460" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/first_keras/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Less,StatefulPartitionedCall/first_keras/Less:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/first_keras/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast,StatefulPartitionedCall/first_keras/Cast:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_2417" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32" offset="8460" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/first_keras/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal,StatefulPartitionedCall/first_keras/Equal:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/first_keras/Cast_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_1,StatefulPartitionedCall/first_keras/Cast_1:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/first_keras/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Add,StatefulPartitionedCall/first_keras/Add:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/first_keras/Cast_2" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="StatefulPartitionedCall/first_keras/Cast_2,StatefulPartitionedCall/first_keras/Cast_2:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/first_keras/Cast_3" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/first_keras/Cast_3,StatefulPartitionedCall/first_keras/Cast_3:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_2418" type="Const" version="opset1">
			<data element_type="i64" shape="1, 32" offset="8588" size="256" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/first_keras/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/add_1,StatefulPartitionedCall/first_keras/add_1:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_975" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8844" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/first_keras/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape,StatefulPartitionedCall/first_keras/Reshape:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/first_keras/mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/mul,StatefulPartitionedCall/first_keras/mul:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/first_keras/GatherV2_1/params" type="Const" version="opset1">
			<data element_type="i64" shape="64" offset="8852" size="512" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/GatherV2_1/params,StatefulPartitionedCall/first_keras/GatherV2_1/params:0">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/first_keras/GatherV2_1/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="9364" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_1/axis,StatefulPartitionedCall/first_keras/GatherV2_1/axis:0" />
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/first_keras/GatherV2_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/GatherV2_1,StatefulPartitionedCall/first_keras/GatherV2_1:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Concat_385" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="9368" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_1/shape,StatefulPartitionedCall/first_keras/Reshape_1/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/first_keras/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>32</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_1,StatefulPartitionedCall/first_keras/Reshape_1:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/first_keras/GatherV2_2/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="8456" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_2/axis,StatefulPartitionedCall/first_keras/GatherV2_2/axis:0" />
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/first_keras/GatherV2_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_2,StatefulPartitionedCall/first_keras/GatherV2_2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_976" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8844" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/first_keras/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_2,StatefulPartitionedCall/first_keras/Reshape_2:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/first_keras/GatherV2_3/params" type="Const" version="opset1">
			<data element_type="f32" shape="64" offset="9376" size="256" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_3/params,StatefulPartitionedCall/first_keras/GatherV2_3/params:0">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/first_keras/GatherV2_3/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="9364" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_3/axis,StatefulPartitionedCall/first_keras/GatherV2_3/axis:0" />
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/first_keras/GatherV2_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_3,StatefulPartitionedCall/first_keras/GatherV2_3:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/first_keras/Less_1" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Less_1,StatefulPartitionedCall/first_keras/Less_1:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/first_keras/Cast_4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_4,StatefulPartitionedCall/first_keras/Cast_4:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/first_keras/Equal_1" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal_1,StatefulPartitionedCall/first_keras/Equal_1:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/first_keras/Cast_5" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_5,StatefulPartitionedCall/first_keras/Cast_5:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/first_keras/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Add_2,StatefulPartitionedCall/first_keras/Add_2:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/first_keras/Cast_6" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="StatefulPartitionedCall/first_keras/Cast_6,StatefulPartitionedCall/first_keras/Cast_6:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/first_keras/Cast_7" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="BOOL">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/first_keras/Cast_7,StatefulPartitionedCall/first_keras/Cast_7:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/first_keras/add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/add_3,StatefulPartitionedCall/first_keras/add_3:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/first_keras/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/mul_1,StatefulPartitionedCall/first_keras/mul_1:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/first_keras/GatherV2_4/params" type="Const" version="opset1">
			<data element_type="i64" shape="128" offset="9632" size="1024" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/GatherV2_4/params,StatefulPartitionedCall/first_keras/GatherV2_4/params:0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/first_keras/GatherV2_4/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="9364" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_4/axis,StatefulPartitionedCall/first_keras/GatherV2_4/axis:0" />
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/first_keras/GatherV2_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/GatherV2_4,StatefulPartitionedCall/first_keras/GatherV2_4:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Concat_434" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="9368" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_3/shape,StatefulPartitionedCall/first_keras/Reshape_3/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/first_keras/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>32</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_3,StatefulPartitionedCall/first_keras/Reshape_3:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/first_keras/GatherV2_5/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="8456" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_5/axis,StatefulPartitionedCall/first_keras/GatherV2_5/axis:0" />
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/first_keras/GatherV2_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_5,StatefulPartitionedCall/first_keras/GatherV2_5:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_977" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8844" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/first_keras/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_4,StatefulPartitionedCall/first_keras/Reshape_4:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/first_keras/GatherV2_6/params" type="Const" version="opset1">
			<data element_type="f32" shape="128" offset="10656" size="512" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_6/params,StatefulPartitionedCall/first_keras/GatherV2_6/params:0">
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/first_keras/GatherV2_6/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="9364" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_6/axis,StatefulPartitionedCall/first_keras/GatherV2_6/axis:0" />
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/first_keras/GatherV2_6" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_6,StatefulPartitionedCall/first_keras/GatherV2_6:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/first_keras/Less_2" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Less_2,StatefulPartitionedCall/first_keras/Less_2:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/first_keras/Cast_8" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_8,StatefulPartitionedCall/first_keras/Cast_8:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/first_keras/Equal_2" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal_2,StatefulPartitionedCall/first_keras/Equal_2:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/first_keras/Cast_9" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_9,StatefulPartitionedCall/first_keras/Cast_9:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/first_keras/Add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Add_4,StatefulPartitionedCall/first_keras/Add_4:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/first_keras/Cast_10" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="StatefulPartitionedCall/first_keras/Cast_10,StatefulPartitionedCall/first_keras/Cast_10:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/first_keras/Cast_11" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="BOOL">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/first_keras/Cast_11,StatefulPartitionedCall/first_keras/Cast_11:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/first_keras/add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/add_5,StatefulPartitionedCall/first_keras/add_5:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/first_keras/mul_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/mul_2,StatefulPartitionedCall/first_keras/mul_2:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/first_keras/GatherV2_7/params" type="Const" version="opset1">
			<data element_type="i64" shape="256" offset="11168" size="2048" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/GatherV2_7/params,StatefulPartitionedCall/first_keras/GatherV2_7/params:0">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/first_keras/GatherV2_7/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="9364" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_7/axis,StatefulPartitionedCall/first_keras/GatherV2_7/axis:0" />
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/first_keras/GatherV2_7" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/GatherV2_7,StatefulPartitionedCall/first_keras/GatherV2_7:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Concat_483" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="9368" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_5/shape,StatefulPartitionedCall/first_keras/Reshape_5/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/first_keras/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>32</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_5,StatefulPartitionedCall/first_keras/Reshape_5:0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/first_keras/GatherV2_8/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="8456" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_8/axis,StatefulPartitionedCall/first_keras/GatherV2_8/axis:0" />
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/first_keras/GatherV2_8" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_8,StatefulPartitionedCall/first_keras/GatherV2_8:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_978" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8844" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/first_keras/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_6,StatefulPartitionedCall/first_keras/Reshape_6:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/first_keras/GatherV2_9/params" type="Const" version="opset1">
			<data element_type="f32" shape="256" offset="13216" size="1024" />
			<output>
				<port id="0" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_9/params,StatefulPartitionedCall/first_keras/GatherV2_9/params:0">
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/first_keras/GatherV2_9/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="9364" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_9/axis,StatefulPartitionedCall/first_keras/GatherV2_9/axis:0" />
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/first_keras/GatherV2_9" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>256</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_9,StatefulPartitionedCall/first_keras/GatherV2_9:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/first_keras/Less_3" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Less_3,StatefulPartitionedCall/first_keras/Less_3:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/first_keras/Cast_12" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_12,StatefulPartitionedCall/first_keras/Cast_12:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/first_keras/Equal_3" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal_3,StatefulPartitionedCall/first_keras/Equal_3:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/first_keras/Cast_13" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_13,StatefulPartitionedCall/first_keras/Cast_13:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/first_keras/Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Add_6,StatefulPartitionedCall/first_keras/Add_6:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/first_keras/Cast_14" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="StatefulPartitionedCall/first_keras/Cast_14,StatefulPartitionedCall/first_keras/Cast_14:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/first_keras/Cast_15" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="BOOL">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/first_keras/Cast_15,StatefulPartitionedCall/first_keras/Cast_15:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/first_keras/add_7" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>32</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/add_7,StatefulPartitionedCall/first_keras/add_7:0">
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/first_keras/Gather/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="14240" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather/axis,StatefulPartitionedCall/first_keras/Gather/axis:0" />
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/first_keras/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>32</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/Gather,StatefulPartitionedCall/first_keras/Gather:0,StatefulPartitionedCall/first_keras/Identity,StatefulPartitionedCall/first_keras/Identity:0">
					<dim>32</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Concat_536" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="14248" size="12" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_7/shape,StatefulPartitionedCall/first_keras/Reshape_7/shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/first_keras/Reshape_7" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_7,StatefulPartitionedCall/first_keras/Reshape_7:0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="StatefulPartitionedCall/first_keras/Sum/reduction_indices" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="8456" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Sum/reduction_indices,StatefulPartitionedCall/first_keras/Sum/reduction_indices:0" />
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/first_keras/Sum" type="ReduceSum" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/StatefulPartitionedCall/output/_7,Func/StatefulPartitionedCall/output/_7:0,Identity,Identity:0,StatefulPartitionedCall/Identity,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/first_keras/Sum,StatefulPartitionedCall/first_keras/Sum:0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Identity" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="70" to-port="0" />
		<edge from-layer="0" from-port="0" to-layer="28" to-port="0" />
		<edge from-layer="0" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="0" from-port="0" to-layer="49" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="85" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="63" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="42" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="21" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="2" />
		<edge from-layer="7" from-port="3" to-layer="9" to-port="0" />
		<edge from-layer="7" from-port="3" to-layer="12" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="15" to-port="0" />
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="18" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="1" />
		<edge from-layer="18" from-port="2" to-layer="20" to-port="0" />
		<edge from-layer="19" from-port="0" to-layer="20" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="21" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="33" to-port="1" />
		<edge from-layer="20" from-port="2" to-layer="24" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="41" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="24" to-port="0" />
		<edge from-layer="23" from-port="0" to-layer="24" to-port="2" />
		<edge from-layer="24" from-port="3" to-layer="26" to-port="0" />
		<edge from-layer="25" from-port="0" to-layer="26" to-port="1" />
		<edge from-layer="26" from-port="2" to-layer="28" to-port="1" />
		<edge from-layer="27" from-port="0" to-layer="28" to-port="2" />
		<edge from-layer="28" from-port="3" to-layer="30" to-port="0" />
		<edge from-layer="29" from-port="0" to-layer="30" to-port="1" />
		<edge from-layer="30" from-port="2" to-layer="34" to-port="0" />
		<edge from-layer="30" from-port="2" to-layer="36" to-port="0" />
		<edge from-layer="31" from-port="0" to-layer="33" to-port="0" />
		<edge from-layer="32" from-port="0" to-layer="33" to-port="2" />
		<edge from-layer="33" from-port="3" to-layer="34" to-port="1" />
		<edge from-layer="33" from-port="3" to-layer="36" to-port="1" />
		<edge from-layer="34" from-port="2" to-layer="35" to-port="0" />
		<edge from-layer="35" from-port="1" to-layer="38" to-port="0" />
		<edge from-layer="36" from-port="2" to-layer="37" to-port="0" />
		<edge from-layer="37" from-port="1" to-layer="38" to-port="1" />
		<edge from-layer="38" from-port="2" to-layer="39" to-port="0" />
		<edge from-layer="39" from-port="1" to-layer="40" to-port="0" />
		<edge from-layer="40" from-port="1" to-layer="41" to-port="1" />
		<edge from-layer="41" from-port="2" to-layer="42" to-port="1" />
		<edge from-layer="41" from-port="2" to-layer="45" to-port="1" />
		<edge from-layer="41" from-port="2" to-layer="54" to-port="1" />
		<edge from-layer="42" from-port="2" to-layer="62" to-port="0" />
		<edge from-layer="43" from-port="0" to-layer="45" to-port="0" />
		<edge from-layer="44" from-port="0" to-layer="45" to-port="2" />
		<edge from-layer="45" from-port="3" to-layer="47" to-port="0" />
		<edge from-layer="46" from-port="0" to-layer="47" to-port="1" />
		<edge from-layer="47" from-port="2" to-layer="49" to-port="1" />
		<edge from-layer="48" from-port="0" to-layer="49" to-port="2" />
		<edge from-layer="49" from-port="3" to-layer="51" to-port="0" />
		<edge from-layer="50" from-port="0" to-layer="51" to-port="1" />
		<edge from-layer="51" from-port="2" to-layer="55" to-port="0" />
		<edge from-layer="51" from-port="2" to-layer="57" to-port="0" />
		<edge from-layer="52" from-port="0" to-layer="54" to-port="0" />
		<edge from-layer="53" from-port="0" to-layer="54" to-port="2" />
		<edge from-layer="54" from-port="3" to-layer="55" to-port="1" />
		<edge from-layer="54" from-port="3" to-layer="57" to-port="1" />
		<edge from-layer="55" from-port="2" to-layer="56" to-port="0" />
		<edge from-layer="56" from-port="1" to-layer="59" to-port="0" />
		<edge from-layer="57" from-port="2" to-layer="58" to-port="0" />
		<edge from-layer="58" from-port="1" to-layer="59" to-port="1" />
		<edge from-layer="59" from-port="2" to-layer="60" to-port="0" />
		<edge from-layer="60" from-port="1" to-layer="61" to-port="0" />
		<edge from-layer="61" from-port="1" to-layer="62" to-port="1" />
		<edge from-layer="62" from-port="2" to-layer="75" to-port="1" />
		<edge from-layer="62" from-port="2" to-layer="63" to-port="1" />
		<edge from-layer="62" from-port="2" to-layer="66" to-port="1" />
		<edge from-layer="63" from-port="2" to-layer="83" to-port="0" />
		<edge from-layer="64" from-port="0" to-layer="66" to-port="0" />
		<edge from-layer="65" from-port="0" to-layer="66" to-port="2" />
		<edge from-layer="66" from-port="3" to-layer="68" to-port="0" />
		<edge from-layer="67" from-port="0" to-layer="68" to-port="1" />
		<edge from-layer="68" from-port="2" to-layer="70" to-port="1" />
		<edge from-layer="69" from-port="0" to-layer="70" to-port="2" />
		<edge from-layer="70" from-port="3" to-layer="72" to-port="0" />
		<edge from-layer="71" from-port="0" to-layer="72" to-port="1" />
		<edge from-layer="72" from-port="2" to-layer="76" to-port="0" />
		<edge from-layer="72" from-port="2" to-layer="78" to-port="0" />
		<edge from-layer="73" from-port="0" to-layer="75" to-port="0" />
		<edge from-layer="74" from-port="0" to-layer="75" to-port="2" />
		<edge from-layer="75" from-port="3" to-layer="76" to-port="1" />
		<edge from-layer="75" from-port="3" to-layer="78" to-port="1" />
		<edge from-layer="76" from-port="2" to-layer="77" to-port="0" />
		<edge from-layer="77" from-port="1" to-layer="80" to-port="0" />
		<edge from-layer="78" from-port="2" to-layer="79" to-port="0" />
		<edge from-layer="79" from-port="1" to-layer="80" to-port="1" />
		<edge from-layer="80" from-port="2" to-layer="81" to-port="0" />
		<edge from-layer="81" from-port="1" to-layer="82" to-port="0" />
		<edge from-layer="82" from-port="1" to-layer="83" to-port="1" />
		<edge from-layer="83" from-port="2" to-layer="85" to-port="1" />
		<edge from-layer="84" from-port="0" to-layer="85" to-port="2" />
		<edge from-layer="85" from-port="3" to-layer="87" to-port="0" />
		<edge from-layer="86" from-port="0" to-layer="87" to-port="1" />
		<edge from-layer="87" from-port="2" to-layer="89" to-port="0" />
		<edge from-layer="88" from-port="0" to-layer="89" to-port="1" />
		<edge from-layer="89" from-port="2" to-layer="90" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<Runtime_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<conversion_parameters>
			<framework value="tf" />
			<input_shape value="[1,8]" />
			<model_name value="PTT_scaling_both_32_4" />
			<output_dir value="DIR" />
			<saved_model_dir value="DIR" />
			<use_new_frontend value="True" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
