<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1,8" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0,Func/StatefulPartitionedCall/input/_0:0,input_1,input_1:0">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="unknown_2" type="Const" version="opset1">
			<data element_type="f32" shape="128, 4" offset="0" size="2048" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_4,Func/StatefulPartitionedCall/input/_4:0,unknown_2,unknown_2:0">
					<dim>128</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="unknown" type="Const" version="opset1">
			<data element_type="i64" shape="64" offset="2048" size="512" />
			<output>
				<port id="0" precision="I64" names="Func/StatefulPartitionedCall/input/_1,Func/StatefulPartitionedCall/input/_1:0,StatefulPartitionedCall/first_keras/GatherV2/ReadVariableOp,StatefulPartitionedCall/first_keras/GatherV2/ReadVariableOp:0,unknown,unknown:0">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/first_keras/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2/axis,StatefulPartitionedCall/first_keras/GatherV2/axis:0" />
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/first_keras/GatherV2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>64</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2,StatefulPartitionedCall/first_keras/GatherV2:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_1522" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64" offset="2564" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/first_keras/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Less,StatefulPartitionedCall/first_keras/Less:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/first_keras/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast,StatefulPartitionedCall/first_keras/Cast:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_1523" type="Const" version="opset1">
			<data element_type="f32" shape="1, 64" offset="2564" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/first_keras/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal,StatefulPartitionedCall/first_keras/Equal:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/first_keras/Cast_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_1,StatefulPartitionedCall/first_keras/Cast_1:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/first_keras/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Add,StatefulPartitionedCall/first_keras/Add:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/first_keras/Cast_2" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="StatefulPartitionedCall/first_keras/Cast_2,StatefulPartitionedCall/first_keras/Cast_2:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/first_keras/Cast_3" type="Convert" version="opset1">
			<data destination_type="i64" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="StatefulPartitionedCall/first_keras/Cast_3,StatefulPartitionedCall/first_keras/Cast_3:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_1524" type="Const" version="opset1">
			<data element_type="i64" shape="1, 64" offset="2820" size="512" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/first_keras/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/add_1,StatefulPartitionedCall/first_keras/add_1:0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_405" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="3332" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/first_keras/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape,StatefulPartitionedCall/first_keras/Reshape:0">
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/first_keras/Gather/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3340" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather/axis,StatefulPartitionedCall/first_keras/Gather/axis:0" />
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/first_keras/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>128</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>64</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/Gather,StatefulPartitionedCall/first_keras/Gather:0,StatefulPartitionedCall/first_keras/Identity,StatefulPartitionedCall/first_keras/Identity:0">
					<dim>64</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Concat_221" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="3348" size="12" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_1/shape,StatefulPartitionedCall/first_keras/Reshape_1/shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/first_keras/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_1,StatefulPartitionedCall/first_keras/Reshape_1:0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/first_keras/Sum/reduction_indices" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Sum/reduction_indices,StatefulPartitionedCall/first_keras/Sum/reduction_indices:0" />
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/first_keras/Sum" type="ReduceSum" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/StatefulPartitionedCall/output/_7,Func/StatefulPartitionedCall/output/_7:0,Identity,Identity:0,StatefulPartitionedCall/Identity,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/first_keras/Sum,StatefulPartitionedCall/first_keras/Sum:0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Identity" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="19" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="2" />
		<edge from-layer="4" from-port="3" to-layer="6" to-port="0" />
		<edge from-layer="4" from-port="3" to-layer="9" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="1" />
		<edge from-layer="15" from-port="2" to-layer="17" to-port="0" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="19" to-port="1" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="2" />
		<edge from-layer="19" from-port="3" to-layer="21" to-port="0" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="23" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="24" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<Runtime_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<conversion_parameters>
			<framework value="tf" />
			<input_shape value="[1,8]" />
			<model_name value="PTT_scaling_depth_1" />
			<output_dir value="DIR" />
			<saved_model_dir value="DIR" />
			<use_new_frontend value="True" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
