<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1,8" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0,Func/StatefulPartitionedCall/input/_0:0,input_1,input_1:0">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="unknown_5" type="Const" version="opset1">
			<data element_type="f32" shape="370176, 4" offset="0" size="5922816" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_7,Func/StatefulPartitionedCall/input/_7:0,unknown_5,unknown_5:0">
					<dim>370176</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="unknown" type="Const" version="opset1">
			<data element_type="i64" shape="370176" offset="5922816" size="2961408" />
			<output>
				<port id="0" precision="I64" names="Func/StatefulPartitionedCall/input/_1,Func/StatefulPartitionedCall/input/_1:0,unknown,unknown:0">
					<dim>370176</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/first_keras/Reshape" type="Const" version="opset1">
			<data element_type="i64" shape="1, 512" offset="8884224" size="4096" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape,StatefulPartitionedCall/first_keras/Reshape:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/first_keras/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="8888320" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2/axis,StatefulPartitionedCall/first_keras/GatherV2/axis:0" />
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/first_keras/GatherV2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2,StatefulPartitionedCall/first_keras/GatherV2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_6124" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="8888324" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/first_keras/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Less,StatefulPartitionedCall/first_keras/Less:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/first_keras/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast,StatefulPartitionedCall/first_keras/Cast:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_6125" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 512" offset="8888324" size="2048" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/first_keras/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal,StatefulPartitionedCall/first_keras/Equal:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/first_keras/Cast_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_1,StatefulPartitionedCall/first_keras/Cast_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/first_keras/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Add,StatefulPartitionedCall/first_keras/Add:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/first_keras/Cast_2" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="StatefulPartitionedCall/first_keras/Cast_2,StatefulPartitionedCall/first_keras/Cast_2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/first_keras/Reshape_2" type="Const" version="opset1">
			<data element_type="i64" shape="1, 512" offset="8890372" size="4096" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_2,StatefulPartitionedCall/first_keras/Reshape_2:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/first_keras/Reshape_3" type="Const" version="opset1">
			<data element_type="i64" shape="1, 512" offset="8894468" size="4096" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_3,StatefulPartitionedCall/first_keras/Reshape_3:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/first_keras/SelectV2" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/SelectV2,StatefulPartitionedCall/first_keras/SelectV2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_6126" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 512" offset="8898564" size="4096" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/first_keras/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/add_1,StatefulPartitionedCall/first_keras/add_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_3121" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8902660" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/first_keras/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_4,StatefulPartitionedCall/first_keras/Reshape_4:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/first_keras/Gather_4/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_4/axis,StatefulPartitionedCall/first_keras/Gather_4/axis:0" />
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/first_keras/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_4,StatefulPartitionedCall/first_keras/Gather_4:0,StatefulPartitionedCall/first_keras/Identity_4,StatefulPartitionedCall/first_keras/Identity_4:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/first_keras/Reshape_5/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_5/shape,StatefulPartitionedCall/first_keras/Reshape_5/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/first_keras/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_5,StatefulPartitionedCall/first_keras/Reshape_5:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/first_keras/GatherV2_1/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="8888320" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_1/axis,StatefulPartitionedCall/first_keras/GatherV2_1/axis:0" />
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/first_keras/GatherV2_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_1,StatefulPartitionedCall/first_keras/GatherV2_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="unknown_1" type="Const" version="opset1">
			<data element_type="f32" shape="370176" offset="8902684" size="1480704" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_3,Func/StatefulPartitionedCall/input/_3:0,unknown_1,unknown_1:0">
					<dim>370176</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/first_keras/Gather_5/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_5/axis,StatefulPartitionedCall/first_keras/Gather_5/axis:0" />
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/first_keras/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/Gather_5,StatefulPartitionedCall/first_keras/Gather_5:0,StatefulPartitionedCall/first_keras/Identity_5,StatefulPartitionedCall/first_keras/Identity_5:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/first_keras/Reshape_6/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_6/shape,StatefulPartitionedCall/first_keras/Reshape_6/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/first_keras/Reshape_6" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_6,StatefulPartitionedCall/first_keras/Reshape_6:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/first_keras/Less_1" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Less_1,StatefulPartitionedCall/first_keras/Less_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/first_keras/Cast_3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_3,StatefulPartitionedCall/first_keras/Cast_3:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/first_keras/Equal_1" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal_1,StatefulPartitionedCall/first_keras/Equal_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/first_keras/Cast_4" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_4,StatefulPartitionedCall/first_keras/Cast_4:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/first_keras/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Add_2,StatefulPartitionedCall/first_keras/Add_2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/first_keras/Cast_5" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="StatefulPartitionedCall/first_keras/Cast_5,StatefulPartitionedCall/first_keras/Cast_5:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="unknown_2" type="Const" version="opset1">
			<data element_type="i64" shape="370176" offset="10383388" size="2961408" />
			<output>
				<port id="0" precision="I64" names="Func/StatefulPartitionedCall/input/_4,Func/StatefulPartitionedCall/input/_4:0,unknown_2,unknown_2:0">
					<dim>370176</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/first_keras/Gather_6/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_6/axis,StatefulPartitionedCall/first_keras/Gather_6/axis:0" />
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/first_keras/Gather_6" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_6,StatefulPartitionedCall/first_keras/Gather_6:0,StatefulPartitionedCall/first_keras/Identity_6,StatefulPartitionedCall/first_keras/Identity_6:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/first_keras/Reshape_7/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_7/shape,StatefulPartitionedCall/first_keras/Reshape_7/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/first_keras/Reshape_7" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_7,StatefulPartitionedCall/first_keras/Reshape_7:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="unknown_3" type="Const" version="opset1">
			<data element_type="i64" shape="370176" offset="13344796" size="2961408" />
			<output>
				<port id="0" precision="I64" names="Func/StatefulPartitionedCall/input/_5,Func/StatefulPartitionedCall/input/_5:0,unknown_3,unknown_3:0">
					<dim>370176</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/first_keras/Gather_7/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_7/axis,StatefulPartitionedCall/first_keras/Gather_7/axis:0" />
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/first_keras/Gather_7" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_7,StatefulPartitionedCall/first_keras/Gather_7:0,StatefulPartitionedCall/first_keras/Identity_7,StatefulPartitionedCall/first_keras/Identity_7:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/first_keras/Reshape_8/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_8/shape,StatefulPartitionedCall/first_keras/Reshape_8/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/first_keras/Reshape_8" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_8,StatefulPartitionedCall/first_keras/Reshape_8:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/first_keras/SelectV2_1" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/SelectV2_1,StatefulPartitionedCall/first_keras/SelectV2_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_6127" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 512" offset="8898564" size="4096" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/first_keras/add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/add_3,StatefulPartitionedCall/first_keras/add_3:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_3122" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8902660" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/first_keras/Reshape_9" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_9,StatefulPartitionedCall/first_keras/Reshape_9:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/first_keras/Gather_8/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_8/axis,StatefulPartitionedCall/first_keras/Gather_8/axis:0" />
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/first_keras/Gather_8" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_8,StatefulPartitionedCall/first_keras/Gather_8:0,StatefulPartitionedCall/first_keras/Identity_8,StatefulPartitionedCall/first_keras/Identity_8:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/first_keras/Reshape_10/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_10/shape,StatefulPartitionedCall/first_keras/Reshape_10/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/first_keras/Reshape_10" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_10,StatefulPartitionedCall/first_keras/Reshape_10:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/first_keras/GatherV2_2/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="8888320" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_2/axis,StatefulPartitionedCall/first_keras/GatherV2_2/axis:0" />
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/first_keras/GatherV2_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_2,StatefulPartitionedCall/first_keras/GatherV2_2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/first_keras/Gather_9/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_9/axis,StatefulPartitionedCall/first_keras/Gather_9/axis:0" />
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/first_keras/Gather_9" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/Gather_9,StatefulPartitionedCall/first_keras/Gather_9:0,StatefulPartitionedCall/first_keras/Identity_9,StatefulPartitionedCall/first_keras/Identity_9:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/first_keras/Reshape_11/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_11/shape,StatefulPartitionedCall/first_keras/Reshape_11/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/first_keras/Reshape_11" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_11,StatefulPartitionedCall/first_keras/Reshape_11:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/first_keras/Less_2" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Less_2,StatefulPartitionedCall/first_keras/Less_2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/first_keras/Cast_6" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_6,StatefulPartitionedCall/first_keras/Cast_6:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/first_keras/Equal_2" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal_2,StatefulPartitionedCall/first_keras/Equal_2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/first_keras/Cast_7" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_7,StatefulPartitionedCall/first_keras/Cast_7:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/first_keras/Add_4" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Add_4,StatefulPartitionedCall/first_keras/Add_4:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/first_keras/Cast_8" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="StatefulPartitionedCall/first_keras/Cast_8,StatefulPartitionedCall/first_keras/Cast_8:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/first_keras/Gather_10/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_10/axis,StatefulPartitionedCall/first_keras/Gather_10/axis:0" />
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/first_keras/Gather_10" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_10,StatefulPartitionedCall/first_keras/Gather_10:0,StatefulPartitionedCall/first_keras/Identity_10,StatefulPartitionedCall/first_keras/Identity_10:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/first_keras/Reshape_12/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_12/shape,StatefulPartitionedCall/first_keras/Reshape_12/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/first_keras/Reshape_12" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_12,StatefulPartitionedCall/first_keras/Reshape_12:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/first_keras/Gather_11/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_11/axis,StatefulPartitionedCall/first_keras/Gather_11/axis:0" />
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/first_keras/Gather_11" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_11,StatefulPartitionedCall/first_keras/Gather_11:0,StatefulPartitionedCall/first_keras/Identity_11,StatefulPartitionedCall/first_keras/Identity_11:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/first_keras/Reshape_13/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_13/shape,StatefulPartitionedCall/first_keras/Reshape_13/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/first_keras/Reshape_13" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_13,StatefulPartitionedCall/first_keras/Reshape_13:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/first_keras/SelectV2_2" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/SelectV2_2,StatefulPartitionedCall/first_keras/SelectV2_2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_6128" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 512" offset="8898564" size="4096" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/first_keras/add_5" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/add_5,StatefulPartitionedCall/first_keras/add_5:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_3123" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="8902660" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/first_keras/Reshape_14" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_14,StatefulPartitionedCall/first_keras/Reshape_14:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/first_keras/Gather_12/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_12/axis,StatefulPartitionedCall/first_keras/Gather_12/axis:0" />
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/first_keras/Gather_12" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_12,StatefulPartitionedCall/first_keras/Gather_12:0,StatefulPartitionedCall/first_keras/Identity_12,StatefulPartitionedCall/first_keras/Identity_12:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/first_keras/Reshape_15/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_15/shape,StatefulPartitionedCall/first_keras/Reshape_15/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/first_keras/Reshape_15" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_15,StatefulPartitionedCall/first_keras/Reshape_15:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/first_keras/GatherV2_3/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="8888320" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2_3/axis,StatefulPartitionedCall/first_keras/GatherV2_3/axis:0" />
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/first_keras/GatherV2_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2_3,StatefulPartitionedCall/first_keras/GatherV2_3:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="StatefulPartitionedCall/first_keras/Gather_13/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_13/axis,StatefulPartitionedCall/first_keras/Gather_13/axis:0" />
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/first_keras/Gather_13" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/Gather_13,StatefulPartitionedCall/first_keras/Gather_13:0,StatefulPartitionedCall/first_keras/Identity_13,StatefulPartitionedCall/first_keras/Identity_13:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="StatefulPartitionedCall/first_keras/Reshape_16/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_16/shape,StatefulPartitionedCall/first_keras/Reshape_16/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/first_keras/Reshape_16" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_16,StatefulPartitionedCall/first_keras/Reshape_16:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="StatefulPartitionedCall/first_keras/Less_3" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Less_3,StatefulPartitionedCall/first_keras/Less_3:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="StatefulPartitionedCall/first_keras/Cast_9" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_9,StatefulPartitionedCall/first_keras/Cast_9:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="StatefulPartitionedCall/first_keras/Equal_3" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal_3,StatefulPartitionedCall/first_keras/Equal_3:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="StatefulPartitionedCall/first_keras/Cast_10" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_10,StatefulPartitionedCall/first_keras/Cast_10:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/first_keras/Add_6" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Add_6,StatefulPartitionedCall/first_keras/Add_6:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/first_keras/Cast_11" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="StatefulPartitionedCall/first_keras/Cast_11,StatefulPartitionedCall/first_keras/Cast_11:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="StatefulPartitionedCall/first_keras/Gather_14/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_14/axis,StatefulPartitionedCall/first_keras/Gather_14/axis:0" />
			</output>
		</layer>
		<layer id="99" name="StatefulPartitionedCall/first_keras/Gather_14" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_14,StatefulPartitionedCall/first_keras/Gather_14:0,StatefulPartitionedCall/first_keras/Identity_14,StatefulPartitionedCall/first_keras/Identity_14:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="StatefulPartitionedCall/first_keras/Reshape_17/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_17/shape,StatefulPartitionedCall/first_keras/Reshape_17/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="StatefulPartitionedCall/first_keras/Reshape_17" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>512</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_17,StatefulPartitionedCall/first_keras/Reshape_17:0">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="StatefulPartitionedCall/first_keras/Gather_15/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="8902668" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_15/axis,StatefulPartitionedCall/first_keras/Gather_15/axis:0" />
			</output>
		</layer>
		<layer id="103" name="StatefulPartitionedCall/first_keras/Gather_15" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>370176</dim>
				</port>
				<port id="1" precision="I64">
					<dim>512</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_15,StatefulPartitionedCall/first_keras/Gather_15:0,StatefulPartitionedCall/first_keras/Identity_15,StatefulPartitionedCall/first_keras/Identity_15:0">
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="StatefulPartitionedCall/first_keras/Reshape_18/shape" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="8902676" size="8" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_18/shape,StatefulPartitionedCall/first_keras/Reshape_18/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="StatefulPartitionedCall/first_keras/Reshape_18" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>512</dim>
				</port>
