<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1,8" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0,Func/StatefulPartitionedCall/input/_0:0,input_1,input_1:0">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="unknown_5" type="Const" version="opset1">
			<data element_type="f32" shape="24, 4" offset="0" size="384" />
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_7,Func/StatefulPartitionedCall/input/_7:0,unknown_5,unknown_5:0">
					<dim>24</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/first_keras/Reshape" type="Const" version="opset1">
			<data element_type="i64" shape="1, 8" offset="384" size="64" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape,StatefulPartitionedCall/first_keras/Reshape:0">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/first_keras/GatherV2/axis" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="448" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/GatherV2/axis,StatefulPartitionedCall/first_keras/GatherV2/axis:0" />
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/first_keras/GatherV2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/GatherV2,StatefulPartitionedCall/first_keras/GatherV2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_1519" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 8" offset="452" size="32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/first_keras/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Less,StatefulPartitionedCall/first_keras/Less:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/first_keras/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast,StatefulPartitionedCall/first_keras/Cast:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_1520" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 8" offset="452" size="32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/first_keras/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal,StatefulPartitionedCall/first_keras/Equal:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/first_keras/Cast_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_1,StatefulPartitionedCall/first_keras/Cast_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/first_keras/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Add,StatefulPartitionedCall/first_keras/Add:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/first_keras/Cast_2" type="Convert" version="opset1">
			<data destination_type="boolean" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="BOOL" names="StatefulPartitionedCall/first_keras/Cast_2,StatefulPartitionedCall/first_keras/Cast_2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/first_keras/Reshape_2" type="Const" version="opset1">
			<data element_type="i64" shape="1, 8" offset="484" size="64" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_2,StatefulPartitionedCall/first_keras/Reshape_2:0">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/first_keras/Reshape_3" type="Const" version="opset1">
			<data element_type="i64" shape="1, 8" offset="548" size="64" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_3,StatefulPartitionedCall/first_keras/Reshape_3:0">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/first_keras/SelectV2" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I64" names="StatefulPartitionedCall/first_keras/SelectV2,StatefulPartitionedCall/first_keras/SelectV2:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_1521" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 8" offset="612" size="64" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/first_keras/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/add_1,StatefulPartitionedCall/first_keras/add_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_406" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="676" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/first_keras/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_4,StatefulPartitionedCall/first_keras/Reshape_4:0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/first_keras/Gather_4/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="684" size="8" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Gather_4/axis,StatefulPartitionedCall/first_keras/Gather_4/axis:0" />
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/first_keras/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>8</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="StatefulPartitionedCall/first_keras/Gather_4,StatefulPartitionedCall/first_keras/Gather_4:0,StatefulPartitionedCall/first_keras/Identity_4,StatefulPartitionedCall/first_keras/Identity_4:0">
					<dim>8</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/first_keras/Reshape_5/shape" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="692" size="12" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Reshape_5/shape,StatefulPartitionedCall/first_keras/Reshape_5/shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/first_keras/Reshape_5" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_5,StatefulPartitionedCall/first_keras/Reshape_5:0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/first_keras/Sum/reduction_indices" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="448" size="4" />
			<output>
				<port id="0" precision="I32" names="StatefulPartitionedCall/first_keras/Sum/reduction_indices,StatefulPartitionedCall/first_keras/Sum/reduction_indices:0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/first_keras/Sum" type="ReduceSum" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/StatefulPartitionedCall/output/_8,Func/StatefulPartitionedCall/output/_8:0,Identity,Identity:0,StatefulPartitionedCall/Identity,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/first_keras/Sum,StatefulPartitionedCall/first_keras/Sum:0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Identity" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="21" to-port="0" />
		<edge from-layer="2" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="2" />
		<edge from-layer="4" from-port="3" to-layer="6" to-port="0" />
		<edge from-layer="4" from-port="3" to-layer="9" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="11" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="10" from-port="1" to-layer="11" to-port="1" />
		<edge from-layer="11" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="12" from-port="1" to-layer="15" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="15" to-port="1" />
		<edge from-layer="14" from-port="0" to-layer="15" to-port="2" />
		<edge from-layer="15" from-port="3" to-layer="17" to-port="0" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="18" from-port="0" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="21" to-port="1" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="2" />
		<edge from-layer="21" from-port="3" to-layer="23" to-port="0" />
		<edge from-layer="22" from-port="0" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="26" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<Runtime_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<conversion_parameters>
			<framework value="tf" />
			<input_shape value="[1,8]" />
			<model_name value="TT_scaling_both_8_1" />
			<output_dir value="DIR" />
			<saved_model_dir value="DIR" />
			<use_new_frontend value="True" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
