<?xml version="1.0"?>
<net name="first_ir" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1,4" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/StatefulPartitionedCall/input/_0:0,input_1,input_1:0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/first_keras/MatMul_2/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 4, 2" offset="0" size="16" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/first_keras/MatMul_2/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/MatMul_2/ReadVariableOp:0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/first_keras/MatMul_1/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 2, 1" offset="16" size="4" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/first_keras/MatMul_1/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/MatMul_1/ReadVariableOp:0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/first_keras/MatMul/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 4" offset="20" size="8" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/first_keras/MatMul/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/MatMul/ReadVariableOp:0">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/first_keras/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/MatMul:0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/first_keras/LessEqual/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1" offset="28" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/first_keras/LessEqual/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/LessEqual/ReadVariableOp:0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/first_keras/LessEqual" type="LessEqual" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/LessEqual:0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/first_keras/Reshape/shape" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="30" size="24" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape/shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/first_keras/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Reshape:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/first_keras/Cast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/first_keras/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/MatMul_1:0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/first_keras/Reshape_1/shape" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="54" size="16" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_1/shape:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/first_keras/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_1:0">
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/first_keras/Equal/ReadVariableOp_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="2, 1" offset="70" size="4" />
			<output>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/first_keras/Equal/ReadVariableOp" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Equal/ReadVariableOp:0">
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/first_keras/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Equal:0">
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/first_keras/Reshape_2/shape" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="74" size="24" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_2/shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/first_keras/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="BOOL">
					<dim>2</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="StatefulPartitionedCall/first_keras/Reshape_2:0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/first_keras/Cast_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="StatefulPartitionedCall/first_keras/Cast_1:0">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/first_keras/MatMul_2" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/MatMul_2:0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/first_keras/Reshape_3/shape" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="98" size="24" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/Reshape_3/shape:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/first_keras/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="StatefulPartitionedCall/first_keras/Reshape_3:0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/first_keras/transpose_1/perm" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="122" size="24" />
			<output>
				<port id="0" precision="I64" names="StatefulPartitionedCall/first_keras/transpose_1/perm:0">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/first_keras/transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/StatefulPartitionedCall/output/_10:0,Identity:0,StatefulPartitionedCall/Identity:0,StatefulPartitionedCall/first_keras/transpose_1:0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Func/StatefulPartitionedCall/output/_10:0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="7" to-port="1" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="1" to-layer="23" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="14" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="0" />
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1" />
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0" />
		<edge from-layer="11" from-port="0" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="13" from-port="1" to-layer="14" to-port="1" />
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="15" from-port="0" to-layer="16" to-port="1" />
		<edge from-layer="16" from-port="2" to-layer="19" to-port="0" />
		<edge from-layer="17" from-port="0" to-layer="18" to-port="0" />
		<edge from-layer="18" from-port="1" to-layer="19" to-port="1" />
		<edge from-layer="19" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="22" to-port="0" />
		<edge from-layer="22" from-port="1" to-layer="23" to-port="1" />
		<edge from-layer="23" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="27" to-port="0" />
		<edge from-layer="26" from-port="0" to-layer="27" to-port="1" />
		<edge from-layer="27" from-port="2" to-layer="28" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<Runtime_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<conversion_parameters>
			<data_type value="FP16" />
			<framework value="tf" />
			<input_shape value="[1, 4]" />
			<model_name value="first_ir" />
			<output_dir value="DIR" />
			<saved_model_dir value="DIR" />
		</conversion_parameters>
		<legacy_frontend value="True" />
	</rt_info>
</net>
