<?xml version="1.0" ?>
<net name="partial_ir" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="[1,1,4,1]" element_type="f32"/>
			<rt_info>
				<attribute name="old_api_map_order" version="0" value="0,2,3,1"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="Func/PartitionedCall/input/_0:0,input_1,input_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="PartitionedCall/first_keras/transpose/perm" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64" names="PartitionedCall/first_keras/transpose/perm:0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="PartitionedCall/first_keras/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/PartitionedCall/output/_1:0,Identity:0,PartitionedCall/Identity:0,PartitionedCall/first_keras/transpose:0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Func/PartitionedCall/output/_1:0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="3" to-port="0"/>
	</edges>
	<rt_info>
		<conversion_parameters>
			<framework value="tf"/>
			<input_shape value="[1,1,4,1]"/>
			<model_name value="partial_ir"/>
			<output_dir value="DIR"/>
			<saved_model_dir value="DIR"/>
		</conversion_parameters>
	</rt_info>
</net>
