<?xml version="1.0"?>
<net name="TensorFlow_Frontend_IR" version="11">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data shape="1,1,4,1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="Func/PartitionedCall/input/_0,Func/PartitionedCall/input/_0:0,input_1,input_1:0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_111" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_112" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Func/PartitionedCall/output/_1,Func/PartitionedCall/output/_1:0,Identity,Identity:0,PartitionedCall/Identity,PartitionedCall/Identity:0,PartitionedCall/first_keras/transpose,PartitionedCall/first_keras/transpose:0">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Identity" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>4</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="3" to-port="0" />
	</edges>
	<rt_info>
		<MO_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<Runtime_version value="2022.3.0-9052-9752fafe8eb-releases/2022/3" />
		<conversion_parameters>
			<framework value="tf" />
			<input_shape value="[1,1,4,1]" />
			<model_name value="partial_ir" />
			<output_dir value="DIR" />
			<saved_model_dir value="DIR" />
			<use_new_frontend value="True" />
		</conversion_parameters>
		<legacy_frontend value="False" />
	</rt_info>
</net>
